app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdf "], ["text", "fda"], ["created_at", "2015-04-15 22:38:58.530322"], ["updated_at", "2015-04-15 22:38:58.530322"]]
---
  def create #saves new article to database using the new.html.erb form
      @article = Article.new(article_params)

# We have to whitelist our controller parameters to prevent wrongful mass assignment. In this case, we want to both allow and require the title and text parameters for valid use of create.
      if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "fda ASL;KDFJ ; ASDF ASDF ASDF ASDF F F F   FAA DFASDF ASDF 43Y34;K J0193JFFA SDF9 0"], ["updated_at", "2015-04-16 20:54:47.392873"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)