app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "BEST POST EVER"], ["body", "SERIOUS. SO DEEP."], ["article_id", 1], ["created_at", "2015-04-16 20:54:07.447879"], ["updated_at", "2015-04-16 20:54:07.447879"]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)